Revit 2024 API
ElectricalAnalyticalLoadSet Class
 Represents the electrical analytical load set, it can contain a set of Electrical Analytical Equipment Loads.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public class ElectricalAnalyticalLoadSet : Element
Visual Basic
Public Class ElectricalAnalyticalLoadSet _
	Inherits Element
Visual C++
public ref class ElectricalAnalyticalLoadSet : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.ElectricalAnalyticalLoadSet
See Also
ElectricalAnalyticalLoadSet Members
Autodesk.Revit.DB.Electrical Namespace